{
  "users": [
    {
      "id": 1,
      "first_name": "Susie",
      "last_name": "Stanley",
      "image": "https://res.cloudinary.com/dllowdq2w/image/upload/v1636436400/susie2_vzbbqq.png",
      "email": "me@me.com",
      "last_visit": 1644100267945
    },
    {
      "first_name": "Taylor",
      "last_name": "Smith",
      "email": "taylor@email.com",
      "image": "https://res.cloudinary.com/dllowdq2w/image/upload/v1635548970/wendy_fampug.png",
      "last_visit": 1635611882958,
      "id": 2
    },
    {
      "id": 3,
      "first_name": "Testy",
      "last_name": "Tester",
      "image": "",
      "email": "test@test.com",
      "last_visit": 1643859602257
    },
    {
      "first_name": "Jane",
      "last_name": "Doe",
      "email": "jane@jane.com",
      "image": "",
      "last_visit": 1643921671899,
      "id": 4
    },
    {
      "first_name": "myfirstname",
      "last_name": "mylastname",
      "email": "name@name.com",
      "image": "",
      "last_visit": 1644174477678,
      "id": 5
    }
  ],
  "recipes": [
    {
      "userId": 1,
      "name": "Sugar Cookies",
      "categoryId": "2",
      "description": "This recipe has been in my baking binder for a long time... probably from when I first learned to bake. Any sugar-lover will like these melt-in-your-mouth cookies. I make them year-round with variations. They're even richer with a thin coat of icing or as a sandwich cookie with frosting in the middle.",
      "instructions": "Preheat oven to 300°. In a small bowl, cream butter until light and fluffy. Beat in vanilla. Combine the flour, sugar and eggs; add to creamed mixture. Beat until dough holds together, about 3 minutes.Pat into a 9x4-in. rectangle. Cut into 2x1-1/2-in. strips. Place 1 in. apart on ungreased baking sheets. Prick with a fork.Bake until set, 20-25 minutes. Cool for 5 minutes before removing from pan to a wire rack to cool completely.",
      "isFave": true,
      "ratingId": 6,
      "prep": "44",
      "cook": "44",
      "servings": "4",
      "date": 1644590309370,
      "id": 1
    },
    {
      "userId": 1,
      "name": "Chocolate Cake",
      "categoryId": 3,
      "description": "Perfect for date night, a Valentine’s Day dessert, a family birthday celebration, or for whenever you need an impressive1/2 cake. We love it with chocolate ganache on top. You can also use this chocolate cake batter to make a small batch of cupcakes. ",
      "instructions": "Preheat oven to 350°F (177°C). Grease a 6×2 inch cake pan, line with parchment paper, then grease the parchment paper. Parchment paper helps the small cake seamlessly release from the pan. I usually grease it with nonstick spray. Make the cake: Whisk the flour, cocoa powder, baking soda, espresso powder, and salt together in a large bowl. In a medium bowl, whisk the oil, sugar, egg, vanilla extract, and buttermilk together in a medium bowl. Pour the wet ingredients into the flour mixture and whisk until smooth and combined. Pour the cake batter evenly into prepared cake pan. Bake for around 27-30 minutes or until the cake is baked through. To test for doneness, insert a toothpick into the center of the cake. If it comes out clean, it’s done. Avoid over-baking. Cake is thick and moist, so the center may slightly sink. That’s normal. Allow cake to cool in the pan set on a wire rack. Cool completely before frosting. Make the chocolate ganache as the cake cools.",
      "isFave": false,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644600651590,
      "id": 2
    },
    {
      "userId": 1,
      "name": "Birthday Cupcakes",
      "categoryId": 4,
      "description": "These are my new & improved birthday cupcakes. Adapted from my original recipe, I use sour cream, cake flour, and extra vanilla to guarantee each cupcake is soft, buttery, and moist. Topped with chocolate buttercream, these updated cupcakes are super flavorful and much easier to prepare than the originals!",
      "instructions": "Preheat the oven to 350°F (177°C). Line a 12-cup muffin pan with cupcake liners. Line a second pan with 2 liners – this recipe makes about 14 cupcakes. Set aside. Whisk the cake flour, baking powder, and salt together. Set aside. Using a handheld or stand mixer fitted with a paddle attachment, beat the butter and sugar together on high speed until smooth and creamy, about 2 minutes. Scrape down the sides and up the bottom of the bowl with a rubber spatula as needed. Add the eggs and vanilla extract. Beat on medium-high speed until combined, then beat in the sour cream. Scrape down the sides and up the bottom of the bowl as needed. With the mixer on low speed, add the dry ingredients until just incorporated. With the mixer still running on low, slowly pour in the milk until combined. Do not over-mix. The batter will be slightly thick. Pour/spoon the batter into the liners. Fill only 2/3 full to avoid spilling over the sides. Bake for 19-22 minutes.",
      "isFave": false,
      "ratingId": 6,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644598982632,
      "id": 3
    },
    {
      "userId": 1,
      "name": "Banana Muffins",
      "categoryId": 5,
      "description": "These banana muffins are soft, buttery, and spiced with cinnamon. They’re wonderful plain, with chopped walnuts, or even chocolate chips. You need 3 ripe bananas and a few basic kitchen ingredients to get started.",
      "instructions": "Preheat oven to 425°F (218°C). Spray a 12-count muffin pan with nonstick spray or use cupcake liners. Whisk the flour, baking powder, baking soda, salt, cinnamon, and nutmeg together in a medium bowl. Set aside. In a large bowl or in the bowl of your stand mixer, mash the bananas. On medium speed, beat or whisk in the melted butter, brown sugar, egg, vanilla extract, and milk. Pour the dry ingredients into the wet ingredients, then beat or whisk until combined. If adding nuts or chocolate chips, fold them in now. Batter will be thick. Spoon the batter into liners, filling them all the way to the top. Bake for 5 minutes at 425 then, keeping the muffins in the oven, reduce the oven temperature to 350°F (177°C). Bake for an additional 16-18 minutes or until a toothpick inserted in the center comes out clean. The total time these muffins take in the oven is about 21-23 minutes, give or take. (For mini muffins, bake 12-14 total minutes at 350°F (177°C).) Allow the muffins to cool for 5 mins",
      "isFave": false,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644598458165,
      "id": 4
    },
    {
      "userId": 1,
      "name": "Fudge Brownies",
      "categoryId": 6,
      "description": "Does the world really need another brownie recipe? Yes, because these are the richest, most decadent homemade brownies you’ll ever try. The best part is that you don’t need a mixer and they’re made in only 1 bowl! ",
      "instructions": "Preheat the oven to 350°F (177°C) and grease a 9×13 inch pan or line with aluminum foil or parchment paper, leaving an overhang on the sides to lift the finished brownies out (makes cutting easier!). Set aside. In a microwave-safe bowl, combine the butter and 2 ounces of chopped chocolate. Melt in 30 second increments, whisking after each, until completely smooth. Whisk in the sugar until completely combined, then whisk in the eggs and vanilla. The batter will be light brown and a little dull looking. Add the cocoa powder, flour, salt, remaining 2 ounces of chopped chocolate and the chocolate chips. Fold it all together with a rubber spatula or wooden spoon. Batter will be very thick. Spread evenly into prepared pan. (See note about how to tell if brownies are done in the post above.) Bake for 30 minutes, then test the brownies with a toothpick. Insert it into the center of the pan. If it comes out with wet batter, the brownies are not done.",
      "isFave": false,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644598301668,
      "id": 5
    },
    {
      "userId": 1,
      "name": "Granola Bars",
      "categoryId": 7,
      "description": "Homemade sweet and salty coconut granola bars are soft, chewy, and pack huge flavor. Made with healthy and wholesome ingredients, these bars are a satisfying and naturally gluten free treat. Skip the oven and allow the bars to set up in the refrigerator or freezer.",
      "instructions": "Line an 8 or 9-inch square baking pan with parchment paper with enough overhang on the sides to easily remove the bars from the pan. Set aside. Pulse the dates in a food processor until they form a chunky paste. (You’ll have about 3 Tablespoons paste.) Or, if you don’t have a food processor, very finely chop the dates. Whisk the date paste/chopped dates, honey, almond butter, and coconut oil together in a medium saucepan over medium heat. Try to break up the dates as much as you can. Once combined and warm, remove from heat. Stir in the vanilla extract and salt until combined. Stir in the remaining ingredients including the chocolate, if using. Press mixture into prepared baking pan and top with extra coconut, if desired. Pack the mixture down as much as you can. I recommend using the back of a flat spatula to really press it tightly. Chill in the refrigerator for at least 1 hour or freeze for 30 minutes before cutting into squares. Store leftover granola bars in the refrigerator.",
      "isFave": false,
      "ratingId": 6,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644600463675,
      "id": 6
    },
    {
      "userId": 1,
      "name": "Gingerbread",
      "categoryId": 8,
      "description": "This is one of my all time favorite gingerbread cookie recipe. Soft in the center, crisp on the edges, perfectly spiced, molasses and brown sugar-sweetened holiday goodness. ",
      "instructions": "Sift together the flour, ginger, baking soda, cinnamon, nutmeg and a pinch of salt into a medium bowl and set aside. Put the butter and brown sugar in the bowl of a stand mixer fitted with a paddle attachment and beat on medium-high speed until light and fluffy, 4 to 6 minutes. Add the egg, molasses, vanilla extract and egg and beat until fully incorporated. Reduce the mixer speed to low and beat in the flour until completely combined. Turn the dough out onto a work surface, flatten into a disc, wrap well with plastic wrap and chill for at least 4 hours or overnight. Preheat the oven to 350 degrees F. Line 1 or 2 baking sheets with parchment paper.",
      "isFave": false,
      "ratingId": 3,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644597165469,
      "id": 7
    },
    {
      "userId": 1,
      "name": "Zucchini Bread",
      "categoryId": 9,
      "description": "Really, really good and moist- my everyone eats it as quickly as I can make it. Bread will freeze well, and keep in refrigerator for weeks at a time and then pop it out for an easy quick snack!",
      "instructions": "Step 1 Grease and flour two 8 x 4 inch pans. Preheat oven to 325 degrees F (165 degrees C). Step 2 Sift flour, salt, baking powder, soda, and cinnamon together in a bowl. Step 3 Beat eggs, oil, vanilla, and sugar together in a large bowl. Add sifted ingredients to the creamed mixture, and beat well. Stir in zucchini and nuts until well combined. Pour batter into prepared pans. Step 4 Bake for 40 to 60 minutes, or until tester inserted in the center comes out clean. Cool in pan on rack for 20 minutes. Remove bread from pan, and completely cool.",
      "isFave": false,
      "ratingId": 6,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644596484570,
      "id": 8
    },
    {
      "userId": 1,
      "name": "Apple Pie",
      "categoryId": 10,
      "description": "This was my great great grandmother's apple pie recipe. I have never seen another one quite like it. It will always be my favorite and has won me several first place prizes in local competitions. I hope it becomes one of your favorites as well!",
      "instructions": "Step 1 Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer. Step 2 Place the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust. Gently pour the sugar and butter liquid over the crust. Pour slowly so that it does not run off. Step 3 Bake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft.",
      "isFave": false,
      "ratingId": 3,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644596313477,
      "id": 9
    },
    {
      "userId": 1,
      "name": "Cookie Icing",
      "categoryId": 11,
      "description": "If you need a new cookie decorating alternative to traditional royal icing, this easy cookie icing is a great choice. It’s like a very thick opaque glaze and comes together with a fork, whisk, and mixing bowl. This cookie icing takes about 24 hours to completely dry and you can’t pipe intricate detail as you could with royal icing but if you want EASY cookie icing, this is it! ",
      "instructions": "Using a fork, stir the confectioners’ sugar, vanilla, corn syrup, and 4.5 Tablespoons (67ml) of water together in a medium bowl. It will be very thick and almost impossible to stir. Switch to a whisk and whisk in 1/2 Tablespoon (8ml) of water. If you lift the whisk and let the icing drizzle back into the bowl, the ribbon of icing will hold shape for a few seconds before melting back into the icing. That is when you know it’s the right consistency and is ready to use. If it’s too thick (sometimes it is), whisk in another 1/2 Tablespoon (8ml) of water or a little more until you reach the consistency. If desired, stir in gel food coloring. You can pour some icing into different bowls if using multiple colors. When tinting icing, only use 1-2 drops at first, stir it in, then add more as needed to reach your desired color. Remember, color darkens as icing dries. Decorate: Spoon icing into squeeze bottles or piping bags fitted with Wilton Piping Tip #4. Decorate your cookies as desired.",
      "isFave": false,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644597805680,
      "id": 10
    },
    {
      "userId": 1,
      "name": "Bon Bons",
      "categoryId": 12,
      "description": "I got this recipe from my mother-in-law. Now, I carry on the tradition of this sweet confection year round but especially around the holidays.",
      "instructions": "Step 1 In large bowl, combine margarine, confectioners' sugar, condensed milk, coconut, chopped walnuts and vanilla. Stir well. Cover and chill in the refrigerator for 2 hours, or until mixture has thickened enough to roll into balls. Roll the mixture into 1-inch balls and place close together, but not touching, on cookie sheets. Freeze until hard. Step 2 While bonbons are freezing, line a cookie sheet or flat surface with waxed paper. Combine chocolate chips and shortening in the top of a double boiler, over, not in, simmering water. Stir until melted. Using a toothpick or a fork, dip each bonbon in the melted chocolate. Place on waxed paper to dry. When chocolate has hardened, store bonbons in plastic bag in the freezer.",
      "isFave": false,
      "ratingId": 3,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644594963460,
      "id": 11
    },
    {
      "userId": 1,
      "name": "Sprinkle Donuts",
      "categoryId": 13,
      "description": "Just like an old-fashioned donut, but better because who doesn't love sprinkles? These babies are perfect for when you are in the mood for a sweet, satisfying treat any time of day.",
      "instructions": "Instructions Checklist Step 1 Preheat the oven to 350 degrees F (175 degrees C). Grease donut pans well. Step 2 Sift flour, sugar, cocoa, baking powder, and salt together into a large bowl. Step 3 Whisk milk, egg, butter, oil, and 2 teaspoons vanilla extract together in a small bowl. Stir into flour mixture until just combined. Step 4 Spoon batter into the prepared donut pans, filling each well 3/4 full. Step 5 Bake in the preheated oven until a toothpick inserted into a donut comes out clean, about 10 minutes. Remove from the oven and let cool for about 5 minutes; tap donuts out onto a sheet pan. Step 6 Combine confectioners' sugar, hot water, and remaining vanilla extract in a bowl to make the glaze. Step 7 Place parchment paper under a wire cooling rack. Transfer cooled donuts to the rack and coat in glaze, letting excess drip onto parchment paper; coat the donuts a second time if desired.",
      "isFave": false,
      "ratingId": 4,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644590325098,
      "id": 12
    },
    {
      "userId": 1,
      "name": "Cinnamon Rolls",
      "categoryId": 14,
      "description": "The BEST cinnamon rolls in the WORLD. Big, fluffy, soft and absolutely delicious. You’ll never go back to any other recipe once you try this one! This cinnamon roll recipe includes options to make them overnight or ahead of time and even freeze them.",
      "instructions": "Warm milk to around 110 degrees F. I like to do this by placing milk in a microwave safe bowl and microwaving it for 40-45 seconds. It should be like warm bath water. Transfer warm milk to the bowl of an electric mixer and sprinkle yeast on top. Add in sugar, egg, egg yolk and melted butter. Mix until well combined. Next stir in flour and salt with a wooden spoon until a dough begins to form. Place dough hook on stand mixer and knead dough on medium speed for 8 minutes. Dough should form into a nice ball and be slightly sticky. If it's TOO sticky (meaning it's sticking to the bottom of the mixer, add in 2 tablespoons more bread flour.) If you don’t want to use an electric mixer, you can use your hands to knead the dough for 8-10 minutes on a well-floured surface. ",
      "isFave": false,
      "ratingId": 5,
      "prep": "120",
      "cook": "20",
      "servings": "8",
      "date": 1644595633874,
      "id": 13
    },
    {
      "userId": 1,
      "name": "Coated Strawberries",
      "categoryId": 15,
      "description": "Why pay top dollar for expensive chocolate covered strawberries when you can easily make them at home - super fresh and at a fraction of the cost? For the best finished look, try to find jumbo berries with stems.",
      "instructions": "Put the semisweet and white chocolates into 2 separate heatproof medium bowls. Fill 2 medium saucepans with a couple inches of water and bring to a simmer over medium heat. Turn off the heat; set the bowls of chocolate over the water to melt. Stir until smooth. (Alternatively, melt the chocolates in a microwave at half power, for 1 minute, stir and then heat for another minute or until melted.) Once the chocolates are melted and smooth, remove from the heat. Line a sheet pan with parchment or waxed paper. Holding the strawberry by the stem, dip the fruit into the dark chocolate, lift and twist slightly, letting any excess chocolate fall back into the bowl. Set strawberries on the parchment paper. Repeat with the rest of the strawberries. Dip a fork in the white chocolate and drizzle the white chocolate over the dipped strawberries.",
      "isFave": true,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644596982415,
      "id": 14
    },
    {
      "userId": 1,
      "name": "Ginger Cookies",
      "categoryId": 2,
      "description": "These ginger cookies are made with crystallized ginger, a little ground ginger and allspice, plus plenty of lemon zest. Citrus and spice make a balanced and refreshing duo, especially if you’re craving a cookie with more depth of flavor. Each cookie is soft and chewy in the centers with irresistibly crisp edges. Use a glaze for a finishing touch.",
      "instructions": "Whisk the flour, baking soda, ginger, allspice, and salt together in a medium bowl. Set aside. In a large bowl using a hand mixer or a stand mixer fitted with a paddle attachment, beat the butter and granulated sugar together on medium-high speed until creamed, about 1 minute. Add the egg, lemon juice, lemon zest, and vanilla extract and beat on high speed until combined, about 1 minute. Scrape down the sides and up the bottom of the bowl and beat again as needed to combine. Add the dry ingredients to the wet ingredients and mix on low until combined. Beat in 2 Tablespoons of chopped crystallized ginger. Dough will be thick and sticky. Scoop small sections of dough (about 1 scant Tablespoon of dough each) and roll into balls. Very lightly dip the tops of each into remaining crystallized ginger. (You don’t want too much– just a few pieces.) Place dough balls onto a large plate or lined baking sheet. Cover and chill the cookie dough balls in the refrigerator for at least 1 hour.",
      "isFave": true,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644600791451,
      "id": 15
    },
    {
      "userId": 1,
      "name": "Strawberry Cake",
      "categoryId": 3,
      "description": "My sisters all loved our grandma's strawberry cake recipe. She thought no one could duplicate it. I made it, and it’s just as scrumptious as we remember. Use fresh strawberries on top as crowning jewels.",
      "instructions": "Preheat oven to 350°. Line the bottoms of 2 greased 8-in. round baking pans with parchment; grease parchment. In a large bowl, combine cake mix, gelatin, sugar and flour. Add water, oil and eggs; beat on low speed 30 seconds. Beat on medium 2 minutes. Fold in chopped strawberries. Transfer to prepared pans. Bake until a toothpick inserted in center comes out clean, 25-30 minutes. Cool in pans 10 minutes before removing to wire racks; remove paper. Cool completely. For frosting, in a small bowl, beat butter until creamy. Beat in crushed strawberries. Gradually beat in enough confectioners’ sugar to reach desired consistency. Spread frosting between layers and over top and sides of cake.",
      "isFave": false,
      "ratingId": 4,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644590998003,
      "id": 16
    },
    {
      "userId": 1,
      "name": "Iced Lemon Cupcakes",
      "categoryId": 4,
      "description": "Sunshine sweet homemade lemon cupcakes are soft and moist, bursting with lemon flavor, and topped with my favorite vanilla buttercream. You’ll love the refreshing zest of citrus flavor in each bite!",
      "instructions": "Preheat the oven to 350°F (177°C). Line a 12-cup muffin pan with cupcake liners. Using a handheld or stand mixer fitted with a paddle attachment, beat the butter and sugar together on medium-high speed in a large bowl until creamed, about 2 minutes. Scrape down the sides and bottom of the bowl as needed. Add eggs and vanilla extract, then beat on medium-high speed until combined, about 1 minute. Scrape down the sides and bottom of the bowl as needed. Set aside. Whisk the flour, baking powder, and salt together in a medium bowl. Pour the dry ingredients into the wet ingredients, start the mixer on low speed, then slowly add the milk, lemon juice, and lemon zest. Once combined, stop the mixer. Do not overmix this batter. Spoon batter evenly into 12 cupcake liners, filling them about 2/3 full. Bake for about 18-22 minutes. A toothpick inserted in the middle will come out clean when they’re done. For around 30 mini cupcakes, bake for about 11-13 minutes, same oven temperature.",
      "isFave": false,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644598871726,
      "id": 17
    },
    {
      "userId": 1,
      "name": "Bran Muffins",
      "categoryId": 5,
      "description": "You’ll love these simple muffins because not only are they incredibly quick and easy, they’re deliciously moist, flavorful, and satisfying. Packed with wholesome ingredients like whole wheat flour and oats, these healthful muffins are naturally free from refined sugar and contain no dairy. There’s no mixer required and you can play around with the add-ins for varying flavors and textures.",
      "instructions": "Preheat oven to 425°F (218°C). Spray a 12-count muffin pan with nonstick spray or use cupcake liners. If using cupcake liners, spray the liners because when warm, these muffins stick. Whisk the flour, oats, cinnamon, baking soda, baking powder, and salt together in a large bowl until combined. Set aside. In a medium bowl, whisk the applesauce, eggs, oil, maple syrup, milk, and vanilla together until combined. Pour the wet ingredients into the dry ingredients, stir a few times, then add the raisins. Fold everything together gently just until combined and no flour pockets remain. Spoon the batter into liners, filling them all the way to the top. Top with oats and a light sprinkle of coarse sugar, if desired. Bake for 5 minutes at 425 then, keeping the muffins in the oven, reduce the oven temperature to 350°F (177°C). Bake for an additional 15-16 minutes or until a toothpick inserted in the center comes out clean. The total time these muffins take in the oven is about 20-21 minutes.",
      "isFave": false,
      "ratingId": 2,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644598727152,
      "id": 18
    },
    {
      "userId": 1,
      "name": "Mocha Blondies",
      "categoryId": 6,
      "description": "These milk chocolate mocha blondies are filled with sweet chocolate and topped with a simple espresso glaze. They’re chewy, dense, and buttery without tasting overly greasy. From mixing bowl to oven in about 10 minutes, this is an easy bar dessert that packs big flavor.",
      "instructions": "Preheat the oven to 350°F (177°C). Grease a 9-inch square pan or line with parchment paper, leaving an overhang on the sides to lift the finished blondies out (makes cutting easier). Set aside. Whisk the flour, baking powder, and salt together in a large bowl. In a medium bowl, whisk the melted butter and espresso powder together. Whisk in the brown sugar until combined, then whisk in the egg, extra egg yolk, and vanilla extract. Pour the wet ingredients into the dry ingredients and whisk or stir until combined. Batter is pretty heavy and thick, so I usually use a rubber spatula. Fold in the chocolate. Evenly spread batter into prepared pan. Bake for about 30-35 minutes, or until a toothpick comes out *mostly* clean. A couple moist crumbs are ok, as long as it’s not wet. Remove from the oven and cool blondies completely in the pan set on a wire rack. Make the glaze: Using a fork, mix the espresso powder and warm water together in a medium bowl. Whisk in the confectioners’ sugar and mil",
      "isFave": true,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644598116180,
      "id": 19
    },
    {
      "userId": 1,
      "name": "Lemon Bars",
      "categoryId": 7,
      "description": "You only need 7 ingredients to make these lemon bars. The lemon curd filling is extra thick and creamy and sits on an irresistible butter shortbread crust. Always bake lemon bars at a lower temperature to avoid over-baking. They’re simply the best lemon bars and are perfect for picnics, bake sales, spring brunches, baby showers, and bridal showers.",
      "instructions": "Preheat the oven to 325°F (163°C). Line the bottom and sides of a 9×13 baking pan* with parchment paper, leaving an overhang on the sides to lift the finished bars out (makes cutting easier!). Set aside. Make the crust: Mix the melted butter, sugar, vanilla extract, and salt together in a medium bowl. Add the flour and stir to completely combine. The dough will be thick. Press firmly into prepared pan, making sure the layer of crust is nice and even. Bake for 20-22 minutes or until the edges are lightly browned. Remove from the oven. Using a fork, poke holes all over the top of the warm crust (not all the way through the crust). A new step I swear by, this helps the filling stick and holds the crust in place. Set aside until step 4. Make the filling: Sift the sugar and flour together in a large bowl. Whisk in the eggs, then the lemon juice until completely combined. Pour filling over warm crust. Bake the bars for 22-26 minutes or until center is relatively set and no longer jiggles.",
      "isFave": true,
      "ratingId": 3,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644600951923,
      "id": 20
    },
    {
      "userId": 1,
      "name": "Bourbon Balls",
      "categoryId": 8,
      "description": "It’s not just the kiddos who deserve a treat this year! This twist on old fashioned Bourbon Balls, a classic Southern no bake candy made with finely ground pecans, crushed cookies, chocolate, and a heavy pour of bourbon to hold it all together, is everything nice.",
      "instructions": "Stir together first 4 ingredients in a large bowl until well blended. Step 2 Stir together bourbon and corn syrup until well blended. Stir together bourbon mixture and wafer mixture. Shape into 1-inch balls; roll in powdered sugar. Cover and chill up to 2 weeks.",
      "isFave": true,
      "ratingId": 1,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644594569797,
      "id": 21
    },
    {
      "userId": 1,
      "name": "Blueberry Loaf",
      "categoryId": 9,
      "description": "An easy-to-make, delicious blueberry loaf that works equally well with fresh or frozen blueberries. Give this recipe a shot because it is alway a delicious treat, especially during blueberry season!",
      "instructions": "Step 1 Preheat oven to 350 degrees F (175 degrees C). Grease a loaf pan. Step 2 Mix flour, sugar, baking powder, and salt in a large bowl. Stir milk, oil, egg, and vanilla extract into flour mixture until batter is just blended. Gently fold blueberries into batter; pour into prepared loaf pan. Step 3 Bake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 70 minutes.",
      "isFave": false,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644594337039,
      "id": 22
    },
    {
      "userId": 1,
      "name": "Cherry Pie",
      "categoryId": 10,
      "description": "Does making a fresh home-made pie intimidate you? I promise this incredible dessert specialty is nothing to fear. Out of all pie flavors, cherry pie is where most bakers depend on canned filling, but this one makes the most of fresh cherries and a delicious crust.",
      "instructions": "In a large bowl, stir the cherries, sugar, cornstarch, lemon juice, vanilla, and almond extract together until thoroughly combined. Cover filling and place in the refrigerator as you roll out the pie dough or for up to 24 hours. On a floured work surface, roll out one of the discs of chilled dough (keep the other one in the refrigerator). Turn the dough about a quarter turn after every few rolls until you have a circle 12 inches in diameter. Carefully place the dough into a 9×2 inch pie dish. Tuck it in with your fingers, making sure it is smooth. Use a slotted spoon to spoon and spread the cherries into the crust. Reserve the juice for the next step. Refrigerate pie, uncovered, as you reduce the juices in the next step. Pour the few Tablespoons of leftover juice into a small saucepan over low heat. Cook and stir for 3-4 minutes or until juice has slightly reduced and thickened. Cool for 5 minutes, then pour over cherries in filling.",
      "isFave": false,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644594203949,
      "id": 23
    },
    {
      "userId": 1,
      "name": "Creamcheese Frosting",
      "categoryId": 11,
      "description": "This is my entire extended family's favorite1 cream cheese frosting recipe!  It goes great on Carrot Cake, Red Velvet Cake, and just about any other flavor cake or cupcake you can imagine.  I’ve been making this cream cheese icing for years!",
      "instructions": "Combine butter and cream cheese in the bowl of a stand mixer (or you may use an electric mixer) and beat until creamy, well-combined, and lump-free. Add vanilla extract and salt and stir well to combine. With mixer on low, gradually add powdered sugar until completely combined. Use to frost completely cooled cake or cupcakes.",
      "isFave": false,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644593963293,
      "id": 24
    },
    {
      "userId": 1,
      "name": "Creamy Fudge",
      "categoryId": 12,
      "description": "I make this fudge to give to friends and neighbors. That tradition started years ago when I made more candy than my family and I could eat, so we shared it. It’s a tasty tradition I’m glad to continue.",
      "instructions": "Line a 15x10x1-in. pan with foil; grease foil with 1 tablespoon butter. In a heavy large saucepan, combine sugars, milk and cubed butter. Bring to a rolling boil over medium heat, stirring constantly; cook and stir 5 minutes. Remove from heat. Stir in marshmallows and vanilla until blended. Gradually stir in chocolate chips and chopped chocolate until melted. Fold in pecans. Immediately spread into prepared pan. Refrigerate 1 hour or until firm. Using foil, lift fudge out of pan. Remove foil; cut fudge into 1-in. squares. Store between layers of waxed paper in an airtight container.",
      "isFave": false,
      "ratingId": 1,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644593812055,
      "id": 25
    },
    {
      "userId": 1,
      "name": "Cronut",
      "categoryId": 13,
      "description": "My nieces and nephews love cronuts, but in the summer heat I rarely want to deep-fry them. I tried making this easy air-fryer cronut recipe, and it turned out so well with no mess!",
      "instructions": "Preheat air fryer to 375°. Separate biscuits. Cut out centers using a 1-inch cutter; save centers. In batches, place doughnuts in a single layer in greased air fryer. Cook until golden brown and puffed, turning once, about 5 minutes. In batches, cook doughnut holes until golden brown, 3-4 minutes. Meanwhile, in a shallow dish, combine sugar and cinnamon. In a separate bowl, mix melted butter and vanilla. Brush doughnuts and doughnut holes with butter; toss in sugar mixture. Serve warm.",
      "isFave": true,
      "ratingId": 5,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644593581817,
      "id": 26
    },
    {
      "userId": 1,
      "name": "Pumpkin Roll",
      "categoryId": 14,
      "description": "This pumpkin roll recipe is great to keep in the freezer for a quick dessert for my family or unexpected guests, to take to a gathering, or to give as a yummy gift. ",
      "instructions": "Line a 15x10x1-in. baking pan with waxed paper; grease the paper and set aside. In a large bowl, beat egg yolks on high speed until thick and lemon-colored. Gradually add 1/2 cup sugar and pumpkin, beating on high until sugar is almost dissolved. In a small bowl, beat egg whites until soft peaks form. Gradually add remaining 1/2 cup sugar, beating until stiff peaks form. Fold into egg yolk mixture. Combine the flour, baking soda, cinnamon and salt; gently fold into pumpkin mixture. Spread into prepared pan. Bake at 375° until cake springs back when lightly touched, 12-15 minutes. Cool for 5 minutes. Turn cake onto a kitchen towel dusted with confectioners’ sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack. In a small bowl, beat the cream cheese, butter, confectioners' sugar and vanilla until smooth. Unroll cake; spread filling evenly to within 1/2 in. of edges. Roll up again, without towel. Cover a",
      "isFave": false,
      "ratingId": 4,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644593300177,
      "id": 27
    },
    {
      "userId": 1,
      "name": "Fruity Cheesecake",
      "categoryId": 15,
      "description": "Cheesecake is my mom's favorite dessert. I made this especially for her on Mother's Day to thank her for being such an awesome example of strength and courage. Decorate with whatever seasonal fruit you like! Get adventurous!",
      "instructions": "Preheat oven to 350°. In a small bowl, combine wafer crumbs, butter and 1 teaspoon sugar. Press onto the bottom and 1/2 in. up sides of a greased 9-in. springform pan. Bake 8 minutes. Cool on a wire rack. Reduce oven setting to 325°. In a large bowl, beat cream cheeses and remaining 1-1/4 cups sugar until smooth. Beat in sour cream, cornstarch and vanilla. Add eggs and egg whites; beat on low speed just until blended. Pour into crust. Place pan on a baking sheet. Bake 60-65 minutes or until center is almost set. Cool on a wire rack 10 minutes. Loosen sides from pan with a knife. Cool 1 hour longer. Refrigerate overnight, covering when completely cooled. Remove rim from pan. Top cheesecake with strawberries.",
      "isFave": true,
      "ratingId": 6,
      "prep": "20",
      "cook": "30",
      "servings": "6",
      "date": 1644615341514,
      "id": 28
    },
    {
      "userId": 1,
      "name": "Snickerdoodles",
      "categoryId": "2",
      "description": "I love these sweet cinnamon treats. Great with a big mug of milk on a cold snowy day! I like to use light brown sugar on top.",
      "instructions": "Preheat the oven to 325°F (163°C). Line the bottom and sides of a 9×13 baking pan* with parchment paper, leaving an overhang on the sides to lift the finished bars out (makes cutting easier!). Set aside. Make the crust: Mix the melted butter, sugar, vanilla extract, and salt together in a medium bowl. Add the flour and stir to completely combine. The dough will be thick. Press firmly into prepared pan, making sure the layer of crust is nice and even. Bake for 20-22 minutes or until the edges are lightly browned. Remove from the oven. Using a fork, poke holes all over the top of the warm crust (not all the way through the crust). A new step I swear by, this helps the filling stick and holds the crust in place. Set aside until step 4. Make the filling: Sift the sugar and flour together in a large bowl. Whisk in the eggs, then the lemon juice until completely combined. Pour filling over warm crust. Bake the bars for 22-26 minutes or until the center is relatively set and no longer jiggles",
      "isFave": true,
      "ratingId": 6,
      "prep": "30",
      "cook": "30",
      "servings": "12",
      "date": 1644601098133,
      "id": 29
    },
    {
      "userId": 1,
      "name": "Blueberry Muffins",
      "categoryId": 5,
      "description": "Everyone loves a hot warm muffin straight out of the oven smothered in creamy butter! These are great warm and cold and contain lots of antioxidants too.",
      "instructions": "Preheat the oven to 325°F (163°C). Line the bottom and sides of a 9×13 baking pan* with parchment paper, leaving an overhang on the sides to lift the finished bars out (makes cutting easier!). Set aside. Make the crust: Mix the melted butter, sugar, vanilla extract, and salt together in a medium bowl. Add the flour and stir to completely combine. The dough will be thick. Press firmly into prepared pan, making sure the layer of crust is nice and even. Bake for 20-22 minutes or until the edges are lightly browned. Remove from the oven. Using a fork, poke holes all over the top of the warm crust (not all the way through the crust). A new step I swear by, this helps the filling stick and holds the crust in place. Set aside until step 4. Make the filling: Sift the sugar and flour together in a large bowl. Whisk in the eggs, then the lemon juice until completely combined. Pour filling over warm crust. Bake the bars for 22-26 minutes or until the center is relatively set and no longer jiggles",
      "isFave": true,
      "ratingId": 3,
      "prep": "3",
      "cook": "3",
      "servings": "3",
      "date": 1644601021845,
      "id": 30
    },
    {
      "userId": 1,
      "name": "S'mores Bars",
      "categoryId": 7,
      "description": "This recipe is a new twist on the old tradition of everyone's campfire favorite! This brings back great memories of my childhood. Back when days were simpler and life was slower.",
      "instructions": "Preheat the oven to 325°F (163°C). Line the bottom and sides of a 9×13 baking pan* with parchment paper, leaving an overhang on the sides to lift the finished bars out (makes cutting easier!). Set aside. Make the crust: Mix the melted butter, sugar, vanilla extract, and salt together in a medium bowl. Add the flour and stir to completely combine. The dough will be thick. Press firmly into prepared pan, making sure the layer of crust is nice and even. Bake for 20-22 minutes or until the edges are lightly browned. Remove from the oven. Using a fork, poke holes all over the top of the warm crust (not all the way through the crust). A new step I swear by, this helps the filling stick and holds the crust in place. Set aside until step 4. Make the filling: Sift the sugar and flour together in a large bowl. Whisk in the eggs, then the lemon juice until completely combined. Pour filling over warm crust. Bake the bars for 22-26 minutes or until the center is relatively set and no longer jiggles",
      "isFave": false,
      "ratingId": 3,
      "prep": "20",
      "cook": "10",
      "servings": "6",
      "date": 1644601432638,
      "id": 31
    },
    {
      "userId": 1,
      "name": "Croissants",
      "categoryId": 15,
      "description": "These soft buttery french \"kwasson\" will melt in your mouth. The combination of textures between the flakey pastry and buttery smoothness transport me to Paris.",
      "instructions": "For the croissant dough: In the bowl of your stand mixer, combine the flour, yeast, sugar and salt, then whisk together. Add 2 tablespoons of room temperature butter and beat with the paddle attachment. Mix on low speed until combined and the butter is no longer visible. Add the milk. Mix on low speed until the dough comes together, then switch to the dough hook. Knead on medium-high until the dough comes together into a smooth but still slightly loose ball, about 5 minutes. Remove from the mixer, then pat into a rectangle and wrap in plastic wrap. Let rest in the refrigerator for 1 hour.",
      "isFave": false,
      "ratingId": 4,
      "prep": "30",
      "cook": "30",
      "servings": "6",
      "date": 1644555076083,
      "id": 32
    },
    {
      "userId": 1,
      "name": "Hazelnut Balls",
      "categoryId": 12,
      "description": "These classic chocolate candies are a hit everytime. Chopped hazelnuts coated in chocolate on the outside and delicious hazelnut creme on the inside. Time consuming process but worth every minute once you taste them.",
      "instructions": "Roll into balls then use fork to dip in chocolate, roll in nuts, then dip again in chocolate. Messy but tasty!",
      "isFave": false,
      "ratingId": 4,
      "prep": "45",
      "cook": "60",
      "servings": "24",
      "date": 1644548368869,
      "id": 33
    },
    {
      "userId": 1,
      "name": "Peach Turnover",
      "categoryId": "10",
      "description": "Yummy in my tummy. You can make these with apple, cherry, strawberry-rhubarb, peach... the options are endless. Add a nice glaze on top for the finishing touch! Use refrigerated crescent rolls if you want to make these fruit-filled pastries in a hurry.",
      "instructions": "Bake the turnovers then eat them all at once!",
      "isFave": false,
      "ratingId": 6,
      "prep": "45",
      "cook": "30",
      "servings": "12",
      "date": 1644590636239,
      "id": 34
    },
    {
      "userId": 1,
      "name": "Strawberry Cupcakes",
      "categoryId": 4,
      "description": "Yummy strawberry flavors burst out from every bite of these delicious cuppy-cakes! Don't leave them out because they will be consumed very quickly. Use cream cheese frosting for a next level experience.",
      "instructions": "Preheat the oven to 325°F (163°C). Line the bottom and sides of a 9×13 baking pan* with parchment paper, leaving an overhang on the sides to lift the finished bars out (makes cutting easier!). Set aside. Make the crust: Mix the melted butter, sugar, vanilla extract, and salt together in a medium bowl. Add the flour and stir to completely combine. The dough will be thick. Press firmly into prepared pan, making sure the layer of crust is nice and even. Bake for 20-22 minutes or until the edges are lightly browned. Remove from the oven. Using a fork, poke holes all over the top of the warm crust (not all the way through the crust). A new step I swear by, this helps the filling stick and holds the crust in place. Set aside until step 4. Make the filling: Sift the sugar and flour together in a large bowl. Whisk in the eggs, then the lemon juice until completely combined. Pour filling over warm crust. Bake the bars for 22-26 minutes or until the center is relatively set and no longer jiggles",
      "isFave": false,
      "ratingId": 5,
      "prep": "30",
      "cook": "30",
      "servings": "12",
      "date": 1644601364034,
      "id": 35
    },
    {
      "userId": 1,
      "name": "Chocolate Chip Cookies",
      "categoryId": 2,
      "description": "Classic boring chocolate chip cookie that everyone loves and I don't know why :) Even though there are so many other choices that are far superior, this seems to be the crowd-pleaser. If you aren't being adventurous, this is your cookie :)",
      "instructions": "Preheat the oven to 325°F (163°C). Line the bottom and sides of a 9×13 baking pan* with parchment paper, leaving an overhang on the sides to lift the finished bars out (makes cutting easier!). Set aside. Make the crust: Mix the melted butter, sugar, vanilla extract, and salt together in a medium bowl. Add the flour and stir to completely combine. The dough will be thick. Press firmly into prepared pan, making sure the layer of crust is nice and even. Bake for 20-22 minutes or until the edges are lightly browned. Remove from the oven. Using a fork, poke holes all over the top of the warm crust (not all the way through the crust). A new step I swear by, this helps the filling stick and holds the crust in place. Set aside until step 4. Make the filling: Sift the sugar and flour together in a large bowl. Whisk in the eggs, then the lemon juice until completely combined. Pour filling over warm crust. Bake the bars for 22-26 minutes or until the center is relatively set and no longer jiggles",
      "isFave": false,
      "ratingId": 6,
      "prep": "30",
      "cook": "30",
      "servings": "24",
      "date": 1644601414379,
      "id": 36
    },
    {
      "userId": 1,
      "name": "Butter Cookies",
      "categoryId": 2,
      "description": "Who could resist these? I’ve loved these cookies as long as I can remember and they’ll always be one of my favorites. These easy homemade cookies are soft and chewy, packed with butter flavor, and they’re super delicious dunked in milk!",
      "instructions": "Preheat oven to 350 degrees F. Line two 18 by 13-inch baking sheets with silicone baking liners or parchment paper.  In a medium mixing bowl whisk together flour, baking soda, baking powder, and salt. Set aside. In the bowl of an electric stand mixer fitted with the paddle attachment cream together butter, granulated sugar, and brown sugar until combined. Mix in peanut butter then blend in egg and vanilla. With mixer set on low speed slowly add in flour mixture and mix just until combined.  Scoop dough out and shape into balls (30 grams each or nearly 2 Tbsp) then place on baking sheets spacing them 2-inches apart. Using a long pronged fork flatten cookies slightly then turn fork going opposite direction and flatten just slightly again (it should create that criss cross pattern). Bake cookies in preheated oven, one sheet at a time, for about 9 minutes (cookies will appear pale and slightly under-baked, they'll continue to cook slightly as they cool).  Let cool on baking sheet 5 minutes then transfer to a wire rack to cool completely. Store cookies and an airtight container.",
      "isFave": false,
      "ratingId": 5,
      "prep": "30",
      "cook": "30",
      "servings": "6",
      "date": 1644612901900,
      "id": 37
    },
    {
      "userId": 1,
      "name": "Oreo Fudge Cake",
      "categoryId": 3,
      "description": "This is such a decadent chocolate cake. Sour cream makes it very moist. The cream cheese Oreo filling is so delicious, make sure not to taste too much of it so there's some for the cake (it's that good). Drizzling fudge over the cake takes this over the top.",
      "instructions": "Preheat oven to 350 degrees F. Line two 18 by 13-inch baking sheets with silicone baking liners or parchment paper. In a medium mixing bowl whisk together flour, baking soda, baking powder, and salt. Set aside.In the bowl of an electric stand mixer fitted with the paddle attachment cream together butter, granulated sugar, and brown sugar until combined.Mix in peanut butter then blend in egg and vanilla. With mixer set on low speed slowly add in flour mixture and mix just until combined. Scoop dough out and shape into balls (30 grams each or nearly 2 Tbsp) then place on baking sheets spacing them 2-inches apart.Using a long pronged fork flatten cookies slightly then turn fork going opposite direction and flatten just slightly again (it should create that criss cross pattern).Bake cookies in preheated oven, one sheet at a time, for about 9 minutes (cookies will appear pale and slightly under-baked, they'll continue to cook slightly as they cool). Let cool on baking sheet 5 minutes then transfer to a wire rack to cool completely. Store cookies and an airtight container.",
      "isFave": false,
      "ratingId": 5,
      "prep": "30",
      "cook": "30",
      "servings": "6",
      "date": 1644613277078,
      "id": 38
    },
    {
      "userId": 1,
      "name": "Cookie Cut-outs",
      "categoryId": 8,
      "description": "Holiday cookies sent from heaven!! These are the quintessential sugar cookie cutouts that everyone loves to make during the winter holiday season.",
      "instructions": "Whisk the flour, baking powder, and salt together in a medium bowl. Set aside.\nIn a large bowl using a hand mixer or a stand mixer fitted with a paddle attachment, beat the butter and sugar together on high speed until completely smooth and creamy, about 2 minutes. Add the egg, vanilla, and almond extract (if using) and beat on high speed until combined, about 1 minute. Scrape down the sides and up the bottom of the bowl and beat again as needed to combine.\nAdd the dry ingredients to the wet ingredients and mix on low until combined. Dough will be relatively soft. If the dough seems too soft and sticky for rolling, add 1 more Tablespoon of flour.\nDivide the dough into 2 equal parts. Place each portion onto a piece of lightly floured parchment paper or a lightly floured silicone baking mat. With a lightly floured rolling pin, roll the dough out to about 1/4-inch thickness. Use more flour if the dough seems too sticky. The rolled-out dough can be any shape, as long as it is evenly 1/4-inch thick.\nLightly dust one of the rolled-out doughs with flour. Place a piece of parchment on top. (This prevents sticking.) Place the 2nd rolled-out dough on top. Cover with plastic wrap or aluminum foil, then refrigerate for at least 1-2 hours and up to 2 days.\nOnce chilled, preheat oven to 350°F (177°C). Line 2-3 large baking sheets with parchment paper or silicone baking mats. Carefully remove the top dough piece from the refrigerator. If it’s sticking to the bottom, run your hand under it to help remove it– see me do this in the video above. Using a cookie cutter, cut the dough into shapes. Re-roll the remaining dough and continue cutting until all is used. Repeat with 2nd piece of dough. Arrange cookies on baking sheets 3 inches apart. Bake for 11-12 minutes or until lightly browned around the edges. If your oven has hot spots, rotate the baking sheet halfway through bake",
      "isFave": true,
      "ratingId": 6,
      "prep": "30",
      "cook": "30",
      "servings": "24",
      "date": 1644613858031,
      "id": 39
    },
    {
      "userId": 1,
      "name": "Banana Bread",
      "categoryId": 9,
      "description": "With its super-moist texture, buttery banana and brown sugar flavors, and incredibly soft crumb, this is my favorite banana bread recipe. You need 4 ripe bananas.",
      "instructions": "Adjust the oven rack to the lower third position and preheat the oven to 350°F (177°C). Grease a 9×5-inch loaf pan or coat with nonstick spray. Set aside.\nWhisk the flour, baking soda, salt, and cinnamon together in a large bowl.\nUsing a handheld or stand mixer fitted with a paddle or whisk attachment, beat the butter and brown sugar together on high speed until smooth and creamy, about 2 minutes. On medium speed, add the eggs one at a time, beating well after each addition. Beat in the yogurt, mashed bananas, and vanilla extract on medium speed until combined. With the mixer running on low speed, slowly beat the dry ingredients into the wet ingredients until no flour pockets remain. Do not overmix. Fold in the nuts, if using.\nSpoon the batter into the prepared baking pan and bake for 60-65 minutes. Loosely cover the bread with aluminum foil after 30 minutes to help prevent the top and sides from getting too brown. A toothpick inserted in the center of the loaf will come out clean when the bread is done. Remove from the oven and allow the bread to cool completely in the pan set on a wire rack.\nCover and store banana bread at room temperature for 2 days or in the refrigerator for up to 1 week. Banana bread tastes best on day 2 after the flavors have settled together. See post above for freezing instructions.",
      "isFave": false,
      "ratingId": 4,
      "prep": "30",
      "cook": "45",
      "servings": "8",
      "date": 1644614016478,
      "id": 40
    }
  ],
  "categories": [
    {
      "name": "All Recipes",
      "image": "140cakeslice.png",
      "id": 1
    },
    {
      "name": "Cookies",
      "image": "140cookie.png",
      "id": 2
    },
    {
      "name": "Cakes",
      "image": "140cakefull.png",
      "id": 3
    },
    {
      "name": "Cupcakes",
      "image": "140cupcake.png",
      "id": 4
    },
    {
      "name": "Muffins",
      "image": "140muffin.png",
      "id": 5
    },
    {
      "name": "Brownies",
      "image": "140brownie.png",
      "id": 6
    },
    {
      "name": "Bars",
      "image": "140bar.png",
      "id": 7
    },
    {
      "name": "Holidays",
      "image": "140holiday.png",
      "id": 8
    },
    {
      "name": "Breads",
      "image": "140bread.png",
      "id": 9
    },
    {
      "name": "Pies",
      "image": "140pie.png",
      "id": 10
    },
    {
      "name": "Frosting",
      "image": "140frosting.png",
      "id": 11
    },
    {
      "name": "Candy",
      "image": "140candy.png",
      "id": 12
    },
    {
      "name": "Donuts",
      "image": "140donut.png",
      "id": 13
    },
    {
      "name": "Rolls ",
      "image": "140roll.png",
      "id": 14
    },
    {
      "name": "Other",
      "image": "140other.png",
      "id": 15
    }
  ],
  "measurements": [
    {
      "name": "tsp",
      "id": 1
    },
    {
      "name": "tbsp",
      "id": 2
    },
    {
      "name": "cup",
      "id": 3
    },
    {
      "name": "cups",
      "id": 4
    },
    {
      "name": "pinch",
      "id": 5
    },
    {
      "name": "dash",
      "id": 6
    },
    {
      "name": "pint",
      "id": 7
    },
    {
      "name": "quart",
      "id": 8
    },
    {
      "name": "stick",
      "id": 9
    },
    {
      "name": "box",
      "id": 10
    },
    {
      "name": "boxes",
      "id": 11
    },
    {
      "name": "can(s)",
      "id": 11
    },
    {
      "name": "oz",
      "id": 12
    },
    {
      "name": "liter",
      "id": 13
    },
    {
      "name": "ml",
      "id": 14
    },
    {
      "name": "gram(s)",
      "id": 15
    },
    {
      "name": "piece(s)",
      "id": 16
    },
    {
      "name": "bag(s)",
      "id": 17
    },
    {
      "name": "whole",
      "id": 18
    },
    {
      "name": "half",
      "id": 19
    },
    {
      "name": "third",
      "id": 20
    },
    {
      "name": "quarter",
      "id": 21
    },
    {
      "name": "lb",
      "id": 22
    },
    {
      "name": "kg",
      "id": 23
    },
    {
      "name": "package",
      "id": 24
    },
    {
      "name": "large",
      "id": 25
    },
    {
      "name": "medium",
      "id": 26
    },
    {
      "name": "small",
      "id": 27
    }
  ],
  "ingredients": [
    {
      "recipeId": 1,
      "label": "sugar",
      "amount": 2,
      "measurement": "tbsp",
      "id": 1
    },
    {
      "recipeId": 1,
      "label": "butter",
      "amount": 2,
      "measurement": "cups",
      "id": 2
    },
    {
      "recipeId": 1,
      "label": "flour",
      "amount": 2,
      "measurement": "tbsp",
      "id": 3
    },
    {
      "amount": "3",
      "measurement": "cups",
      "label": "vinegar",
      "recipeId": "1",
      "id": 4
    },
    {
      "label": "vodka",
      "amount": "5",
      "measurement": "oz",
      "recipeId": 1,
      "id": 5
    },
    {
      "amount": "4",
      "measurement": "pinch",
      "label": "tabasco",
      "recipeId": 1,
      "id": 6
    },
    {
      "label": "honey",
      "amount": "1",
      "measurement": "tsp",
      "recipeId": 1,
      "id": 7
    },
    {
      "amount": "4",
      "measurement": "cups",
      "label": "cream",
      "recipeId": 1,
      "id": 8
    },
    {
      "recipeId": 15,
      "label": "flour",
      "amount": "2",
      "measurement": "cups",
      "id": 10
    },
    {
      "label": "sugar",
      "amount": "3",
      "measurement": "cups",
      "recipeId": 15,
      "id": 11
    },
    {
      "label": "molasses",
      "amount": "2",
      "measurement": "tbsp",
      "recipeId": 15,
      "id": 12
    },
    {
      "label": "brown sugar",
      "amount": "3",
      "measurement": "cups",
      "recipeId": 29,
      "id": 13
    },
    {
      "label": "blueberries",
      "amount": "3",
      "measurement": "cups",
      "recipeId": 30,
      "id": 14
    },
    {
      "recipeId": 20,
      "label": "sugar",
      "amount": "2",
      "measurement": "cups",
      "id": 15
    },
    {
      "label": "lemons",
      "amount": "4",
      "measurement": "oz",
      "recipeId": 20,
      "id": 16
    },
    {
      "recipeId": 6,
      "label": "chocolate chips",
      "amount": "4",
      "measurement": "cups",
      "id": 17
    },
    {
      "label": "whipped marshmallow",
      "amount": "24",
      "measurement": "oz",
      "recipeId": 31,
      "id": 18
    },
    {
      "recipeId": 10,
      "label": "powdered sugar",
      "amount": "2",
      "measurement": "cups",
      "id": 19
    },
    {
      "label": "sugar",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 3,
      "id": 21
    },
    {
      "recipeId": 4,
      "label": "bananas",
      "amount": "3",
      "measurement": "whole",
      "id": 22
    },
    {
      "recipeId": 5,
      "label": "chocolate chips",
      "amount": "2",
      "measurement": "bags",
      "id": 23
    },
    {
      "recipeId": 19,
      "label": "flour",
      "amount": "2",
      "measurement": "cups",
      "id": 24
    },
    {
      "label": "chocolate chips",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 19,
      "id": 25
    },
    {
      "recipeId": 31,
      "label": "chocolate chips",
      "amount": "1",
      "measurement": "bags",
      "id": 26
    },
    {
      "label": "graham crackers",
      "amount": "24",
      "measurement": "pieces",
      "recipeId": 31,
      "id": 27
    },
    {
      "recipeId": 7,
      "label": "ginger",
      "amount": "2",
      "measurement": "tsp",
      "id": 28
    },
    {
      "label": "flour",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 7,
      "id": 29
    },
    {
      "recipeId": 11,
      "label": "chopped chocolate",
      "amount": "2",
      "measurement": "quart",
      "id": 30
    },
    {
      "recipeId": 21,
      "label": "hazelnuts",
      "amount": "1",
      "measurement": "cup",
      "id": 31
    },
    {
      "recipeId": 25,
      "label": "chocolate chips",
      "amount": "3",
      "measurement": "bags",
      "id": 32
    },
    {
      "label": "sugar",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 25,
      "id": 33
    },
    {
      "label": "sugar",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 26,
      "id": 34
    },
    {
      "recipeId": 26,
      "label": "flour",
      "amount": "3",
      "measurement": "cups",
      "id": 35
    },
    {
      "label": "butter",
      "amount": "2",
      "measurement": "stick",
      "recipeId": 32,
      "id": 36
    },
    {
      "label": "hazelnuts (chopped)",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 33,
      "id": 37
    },
    {
      "label": "sugar",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 35,
      "id": 39
    },
    {
      "recipeId": 34,
      "label": "peach filling",
      "amount": "2",
      "measurement": "can(s)",
      "id": 40
    },
    {
      "label": "chocolate chips",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 36,
      "id": 41
    },
    {
      "label": "sugar",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 36,
      "id": 42
    },
    {
      "label": "flour",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 36,
      "id": 43
    },
    {
      "recipeId": 12,
      "label": "egg",
      "amount": "1",
      "measurement": "whole",
      "id": 44
    },
    {
      "label": "sugar",
      "amount": "1/2",
      "measurement": "cup",
      "recipeId": 12,
      "id": 45
    },
    {
      "label": "sour cream",
      "amount": "6",
      "measurement": "oz",
      "recipeId": 12,
      "id": 46
    },
    {
      "label": "butter",
      "amount": "2",
      "measurement": "tbsp",
      "recipeId": 12,
      "id": 47
    },
    {
      "label": "flour",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 12,
      "id": 48
    },
    {
      "recipeId": 32,
      "label": "flour",
      "amount": "3",
      "measurement": "cups",
      "id": 49
    },
    {
      "label": "sugar",
      "amount": "3",
      "measurement": "tbsp",
      "recipeId": 32,
      "id": 50
    },
    {
      "label": "warm milk",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 32,
      "id": 51
    },
    {
      "label": "instant yeast",
      "amount": "1",
      "measurement": "package",
      "recipeId": 32,
      "id": 52
    },
    {
      "recipeId": 27,
      "label": "pumpkin puree",
      "amount": "2",
      "measurement": "can(s)",
      "id": 53
    },
    {
      "label": "cream cheese",
      "amount": "8",
      "measurement": "oz",
      "recipeId": 27,
      "id": 54
    },
    {
      "label": "cinnamon",
      "amount": "1/2",
      "measurement": "tsp",
      "recipeId": 27,
      "id": 55
    },
    {
      "label": "vanilla",
      "amount": "1",
      "measurement": "tbsp",
      "recipeId": 27,
      "id": 56
    },
    {
      "label": "sugar",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 27,
      "id": 57
    },
    {
      "label": "flour",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 27,
      "id": 58
    },
    {
      "recipeId": 27,
      "label": "powdered sugar",
      "amount": "1",
      "measurement": "cup",
      "id": 59
    },
    {
      "recipeId": 26,
      "label": "butter",
      "amount": "1",
      "measurement": "stick",
      "id": 60
    },
    {
      "label": "vanilla",
      "amount": "1",
      "measurement": "tbsp",
      "recipeId": 26,
      "id": 61
    },
    {
      "recipeId": 25,
      "label": "butter",
      "amount": "1",
      "measurement": "tbsp",
      "id": 62
    },
    {
      "label": "evaporated milk",
      "amount": "1",
      "measurement": "can(s)",
      "recipeId": 25,
      "id": 63
    },
    {
      "label": "chocolate chips",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 25,
      "id": 64
    },
    {
      "label": "sugar",
      "amount": "3",
      "measurement": "cups",
      "recipeId": 25,
      "id": 65
    },
    {
      "recipeId": 24,
      "label": "unsalted butter",
      "amount": "1",
      "measurement": "cup",
      "id": 66
    },
    {
      "label": "cream cheese",
      "amount": "8",
      "measurement": "oz",
      "recipeId": 24,
      "id": 67
    },
    {
      "label": "vanilla",
      "amount": "1",
      "measurement": "tsp",
      "recipeId": 24,
      "id": 68
    },
    {
      "label": "powdered sugar",
      "amount": "4",
      "measurement": "cups",
      "recipeId": 24,
      "id": 69
    },
    {
      "recipeId": 23,
      "label": "flour",
      "amount": "2",
      "measurement": "cups",
      "id": 70
    },
    {
      "label": "sugar",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 23,
      "id": 71
    },
    {
      "label": "fresh cherries",
      "amount": "2",
      "measurement": "lb",
      "recipeId": 23,
      "id": 72
    },
    {
      "label": "butter",
      "amount": "4",
      "measurement": "stick",
      "recipeId": 23,
      "id": 73
    },
    {
      "recipeId": 22,
      "label": "flour",
      "amount": "1",
      "measurement": "cup",
      "id": 74
    },
    {
      "label": "sugar",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 22,
      "id": 75
    },
    {
      "label": "egg",
      "amount": "1",
      "measurement": "large",
      "recipeId": 22,
      "id": 76
    },
    {
      "label": "baking powder",
      "amount": "2",
      "measurement": "tsp",
      "recipeId": 22,
      "id": 77
    },
    {
      "label": "blueberries",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 22,
      "id": 78
    },
    {
      "recipeId": 21,
      "label": "vanilla wafers",
      "amount": "1",
      "measurement": "package",
      "id": 79
    },
    {
      "label": "chopped pecans",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 21,
      "id": 80
    },
    {
      "label": "cocoa",
      "amount": "2",
      "measurement": "tbsp",
      "recipeId": 21,
      "id": 81
    },
    {
      "label": "bourbon",
      "amount": "1/2",
      "measurement": "cup",
      "recipeId": 21,
      "id": 82
    },
    {
      "recipeId": 11,
      "label": "butter",
      "amount": "1",
      "measurement": "cup",
      "id": 83
    },
    {
      "label": "chocolate chips ",
      "amount": "2",
      "measurement": "bag(s)",
      "recipeId": 11,
      "id": 84
    },
    {
      "label": "coconut",
      "amount": "3",
      "measurement": "cups",
      "recipeId": 11,
      "id": 85
    },
    {
      "label": "confectioners sugar",
      "amount": "2",
      "measurement": "lb",
      "recipeId": 11,
      "id": 86
    },
    {
      "label": "butter",
      "amount": "1",
      "measurement": "stick",
      "recipeId": 13,
      "id": 87
    },
    {
      "recipeId": 13,
      "label": "milk",
      "amount": "1",
      "measurement": "cup",
      "id": 88
    },
    {
      "label": "cream cheese",
      "amount": "4",
      "measurement": "oz",
      "recipeId": 13,
      "id": 89
    },
    {
      "label": "sugar",
      "amount": "1/4",
      "measurement": "cup",
      "recipeId": 13,
      "id": 90
    },
    {
      "label": "flour",
      "amount": "3",
      "measurement": "cups",
      "recipeId": 13,
      "id": 91
    },
    {
      "recipeId": 9,
      "label": "sugar",
      "amount": "1",
      "measurement": "cup",
      "id": 92
    },
    {
      "label": "pie crust",
      "amount": "1",
      "measurement": "package",
      "recipeId": 9,
      "id": 93
    },
    {
      "label": "butter",
      "amount": "1",
      "measurement": "stick",
      "recipeId": 9,
      "id": 94
    },
    {
      "label": "butter",
      "amount": "1",
      "measurement": "stick",
      "recipeId": 9,
      "id": 95
    },
    {
      "label": "packed brown sugar",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 9,
      "id": 96
    },
    {
      "label": "flour",
      "amount": "3",
      "measurement": "cup",
      "recipeId": 9,
      "id": 97
    },
    {
      "label": "Granny Smith apples",
      "amount": "8",
      "measurement": "whole",
      "recipeId": 9,
      "id": 98
    },
    {
      "recipeId": 8,
      "label": "flour",
      "amount": "1",
      "measurement": "cups",
      "id": 99
    },
    {
      "label": "eggs",
      "amount": "3",
      "measurement": "large",
      "recipeId": 8,
      "id": 100
    },
    {
      "label": "sugar",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 8,
      "id": 101
    },
    {
      "label": "baking soda",
      "amount": "1",
      "measurement": "tsp",
      "recipeId": 8,
      "id": 102
    },
    {
      "recipeId": 14,
      "label": "semi-sweet chocolate",
      "amount": "6",
      "measurement": "oz",
      "id": 103
    },
    {
      "label": "fresh strawberries",
      "amount": "1",
      "measurement": "lb",
      "recipeId": 14,
      "id": 104
    },
    {
      "label": "white chocolate",
      "amount": "3",
      "measurement": "oz",
      "recipeId": 14,
      "id": 105
    },
    {
      "recipeId": 7,
      "label": "dough",
      "amount": "3",
      "measurement": "cups",
      "id": 106
    },
    {
      "label": "packed brown sugar",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 7,
      "id": 107
    },
    {
      "label": "molasses",
      "amount": "1/2",
      "measurement": "cup",
      "recipeId": 7,
      "id": 108
    },
    {
      "label": "ground ginger",
      "amount": "2",
      "measurement": "tsp",
      "recipeId": 7,
      "id": 109
    },
    {
      "label": "unsalted butter",
      "amount": "12",
      "measurement": "tbsp",
      "recipeId": 7,
      "id": 110
    },
    {
      "recipeId": 10,
      "label": "confectioner sugar",
      "amount": "3",
      "measurement": "cups",
      "id": 111
    },
    {
      "label": "light corn syrup",
      "amount": "2",
      "measurement": "tsp",
      "recipeId": 10,
      "id": 112
    },
    {
      "label": "water",
      "amount": "5",
      "measurement": "tbsp",
      "recipeId": 10,
      "id": 113
    },
    {
      "label": "vanilla",
      "amount": "1/2",
      "measurement": "tsp",
      "recipeId": 10,
      "id": 114
    },
    {
      "label": "egg",
      "amount": "1",
      "measurement": "large",
      "recipeId": 19,
      "id": 115
    },
    {
      "recipeId": 19,
      "label": "butter",
      "amount": "2",
      "measurement": "stick",
      "id": 116
    },
    {
      "label": "espresso",
      "amount": "4",
      "measurement": "tsp",
      "recipeId": 19,
      "id": 117
    },
    {
      "label": "packed brown sugar",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 19,
      "id": 118
    },
    {
      "recipeId": 19,
      "label": "vanilla",
      "amount": "1",
      "measurement": "tbsp",
      "id": 119
    },
    {
      "label": "baking powder",
      "amount": "1",
      "measurement": "tsp",
      "recipeId": 19,
      "id": 120
    },
    {
      "label": "heavy cream",
      "amount": "1",
      "measurement": "tbsp",
      "recipeId": 19,
      "id": 121
    },
    {
      "recipeId": 5,
      "label": "butter",
      "amount": "1",
      "measurement": "stick",
      "id": 122
    },
    {
      "label": "sugar",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 5,
      "id": 123
    },
    {
      "label": "semi-sweet chocolate",
      "amount": "4",
      "measurement": "oz",
      "recipeId": 5,
      "id": 124
    },
    {
      "recipeId": 4,
      "label": "flour",
      "amount": "1",
      "measurement": "cup",
      "id": 125
    },
    {
      "label": "ripe bananas",
      "amount": "3",
      "measurement": "large",
      "recipeId": 4,
      "id": 126
    },
    {
      "label": "unsalted butter",
      "amount": "6",
      "measurement": "tbsp",
      "recipeId": 4,
      "id": 127
    },
    {
      "label": "egg",
      "amount": "1",
      "measurement": "large",
      "recipeId": 4,
      "id": 128
    },
    {
      "label": "baking powder",
      "amount": "1",
      "measurement": "tsp",
      "recipeId": 4,
      "id": 129
    },
    {
      "recipeId": 4,
      "label": "milk",
      "amount": "1",
      "measurement": "tbsp",
      "id": 130
    },
    {
      "label": "chopped walnuts",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 4,
      "id": 131
    },
    {
      "label": "maple syrup",
      "amount": "1/3",
      "measurement": "cup",
      "recipeId": 18,
      "id": 132
    },
    {
      "recipeId": 18,
      "label": "flour",
      "amount": "2",
      "measurement": "cups",
      "id": 133
    },
    {
      "label": "eggs",
      "amount": "2",
      "measurement": "large",
      "recipeId": 18,
      "id": 134
    },
    {
      "label": "cinnamon",
      "amount": "1",
      "measurement": "tsp",
      "recipeId": 18,
      "id": 135
    },
    {
      "recipeId": 17,
      "label": "unsalted butter",
      "amount": "1/2",
      "measurement": "cup",
      "id": 136
    },
    {
      "label": "eggs",
      "amount": "2",
      "measurement": "large",
      "recipeId": 17,
      "id": 137
    },
    {
      "label": "whole milk",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 17,
      "id": 138
    },
    {
      "label": "sugar",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 17,
      "id": 139
    },
    {
      "recipeId": 3,
      "label": "cake flour",
      "amount": "1",
      "measurement": "cup",
      "id": 140
    },
    {
      "label": "unsalted butter",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 3,
      "id": 141
    },
    {
      "recipeId": 6,
      "label": "honey",
      "amount": "1/2",
      "measurement": "cup",
      "id": 142
    },
    {
      "label": "oats",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 6,
      "id": 143
    },
    {
      "label": "almonds",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 6,
      "id": 144
    },
    {
      "label": "almond butter",
      "amount": "1/3",
      "measurement": "cup",
      "recipeId": 6,
      "id": 145
    },
    {
      "label": "semi-sweet chocolate",
      "amount": "1/3",
      "measurement": "cup",
      "recipeId": 6,
      "id": 146
    },
    {
      "recipeId": 2,
      "label": "flour",
      "amount": "1/2",
      "measurement": "cups",
      "id": 147
    },
    {
      "label": "espresso",
      "amount": "1",
      "measurement": "tsp",
      "recipeId": 2,
      "id": 148
    },
    {
      "label": "sugar",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 2,
      "id": 149
    },
    {
      "label": "natural cocoa",
      "amount": "1/4",
      "measurement": "cup",
      "recipeId": 2,
      "id": 150
    },
    {
      "label": "eggs",
      "amount": "1",
      "measurement": "large",
      "recipeId": 2,
      "id": 151
    },
    {
      "recipeId": 15,
      "label": "ginger",
      "amount": "1",
      "measurement": "tbsp",
      "id": 152
    },
    {
      "label": "butter",
      "amount": "1",
      "measurement": "stick",
      "recipeId": 15,
      "id": 153
    },
    {
      "recipeId": 20,
      "label": "unsalted butter",
      "amount": "1",
      "measurement": "cup",
      "id": 154
    },
    {
      "label": "eggs",
      "amount": "6",
      "measurement": "large",
      "recipeId": 20,
      "id": 155
    },
    {
      "label": "vanilla",
      "amount": "1",
      "measurement": "tbsp",
      "recipeId": 20,
      "id": 156
    },
    {
      "recipeId": 30,
      "label": "flour",
      "amount": "1",
      "measurement": "cup",
      "id": 157
    },
    {
      "label": "eggs",
      "amount": "2",
      "measurement": "large",
      "recipeId": 30,
      "id": 158
    },
    {
      "label": "sugar",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 30,
      "id": 159
    },
    {
      "recipeId": 29,
      "label": "flour",
      "amount": "2",
      "measurement": "cups",
      "id": 160
    },
    {
      "label": "butter",
      "amount": "1",
      "measurement": "stick",
      "recipeId": 29,
      "id": 161
    },
    {
      "recipeId": 35,
      "label": "flour",
      "amount": "2",
      "measurement": "cups",
      "id": 162
    },
    {
      "label": "vanilla",
      "amount": "1",
      "measurement": "tbsp",
      "recipeId": 35,
      "id": 163
    },
    {
      "label": "eggs",
      "amount": "3",
      "measurement": "whole",
      "recipeId": 35,
      "id": 164
    },
    {
      "label": "sugar",
      "amount": "2",
      "measurement": "cup",
      "recipeId": 37,
      "id": 165
    },
    {
      "label": "egg",
      "amount": "1",
      "measurement": "large",
      "recipeId": 37,
      "id": 166
    },
    {
      "label": "unsalted butter",
      "amount": "1",
      "measurement": "stick",
      "recipeId": 37,
      "id": 167
    },
    {
      "label": "flour",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 37,
      "id": 168
    },
    {
      "label": "Oreos",
      "amount": "12",
      "measurement": "whole",
      "recipeId": 38,
      "id": 169
    },
    {
      "recipeId": 38,
      "label": "dark fudge cake mis",
      "amount": "1",
      "measurement": "package",
      "id": 170
    },
    {
      "label": "heavy whipping cream",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 38,
      "id": 171
    },
    {
      "label": "sour cream",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 38,
      "id": 172
    },
    {
      "label": "eggs",
      "amount": "3",
      "measurement": "large",
      "recipeId": 38,
      "id": 173
    },
    {
      "label": "sugar",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 39,
      "id": 174
    },
    {
      "label": "eggs",
      "amount": "6",
      "measurement": "large",
      "recipeId": 39,
      "id": 175
    },
    {
      "label": "flour",
      "amount": "6",
      "measurement": "tbsp",
      "recipeId": 39,
      "id": 176
    },
    {
      "label": "butter",
      "amount": "2",
      "measurement": "stick",
      "recipeId": 40,
      "id": 177
    },
    {
      "label": "flour",
      "amount": "2",
      "measurement": "cups",
      "recipeId": 40,
      "id": 178
    },
    {
      "label": "sugar",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 40,
      "id": 179
    },
    {
      "label": "eggs",
      "amount": "2",
      "measurement": "large",
      "recipeId": 40,
      "id": 180
    },
    {
      "label": "packed brown sugar",
      "amount": "1",
      "measurement": "cup",
      "recipeId": 40,
      "id": 181
    },
    {
      "recipeId": 28,
      "label": "sugar",
      "amount": "1",
      "measurement": "cup",
      "id": 182
    },
    {
      "label": "cream cheese",
      "amount": "8",
      "measurement": "oz",
      "recipeId": 28,
      "id": 183
    }
  ],
  "images": [
    {
      "recipeId": 20,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644530377/8_rihh86.png",
      "id": 7
    },
    {
      "recipeId": 6,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644530460/6_oshv3f.png",
      "id": 8
    },
    {
      "recipeId": 31,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644530502/15_w1wo5u.png",
      "id": 9
    },
    {
      "recipeId": 30,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644531048/56_jc6qh8.png",
      "id": 10
    },
    {
      "recipeId": 1,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644531376/51_beke5e.png",
      "id": 11
    },
    {
      "recipeId": 29,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644531415/6_bwqcs1.png",
      "id": 12
    },
    {
      "recipeId": 15,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644532190/gingercookies_aokcnl.png",
      "id": 14
    },
    {
      "recipeId": 2,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644532253/49_kqcazy.png",
      "id": 15
    },
    {
      "recipeId": 16,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644532307/4_pfajh3.png",
      "id": 16
    },
    {
      "recipeId": 3,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644532399/5_wo8ckq.png",
      "id": 17
    },
    {
      "recipeId": 17,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644532784/cupcakes_rsvlee.png",
      "id": 18
    },
    {
      "recipeId": 4,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644532842/61_m8cnrq.png",
      "id": 19
    },
    {
      "recipeId": 18,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644533084/branmuffin_ehbkis.png",
      "id": 21
    },
    {
      "recipeId": 4,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644533196/61_vumiut.png",
      "id": 22
    },
    {
      "recipeId": 5,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644533363/46_rm5tl0.png",
      "id": 24
    },
    {
      "recipeId": 19,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644539915/extra_baked_goods_lwiu52.png",
      "id": 25
    },
    {
      "recipeId": 10,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644542001/icing2_kanara.png",
      "id": 32
    },
    {
      "recipeId": 7,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644542079/11_mfe8ex.png",
      "id": 33
    },
    {
      "recipeId": 14,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644542426/coveredstrawberries_asqou1.png",
      "id": 34
    },
    {
      "recipeId": 8,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644542457/80_j6fcyp.png",
      "id": 35
    },
    {
      "recipeId": 9,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644542558/16_vjqi6y.png",
      "id": 36
    },
    {
      "recipeId": 13,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644545549/42_gnzw11.png",
      "id": 38
    },
    {
      "recipeId": 11,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644545643/35_xk9jg4.png",
      "id": 39
    },
    {
      "recipeId": 11,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644545738/35_hukqnf.png",
      "id": 40
    },
    {
      "recipeId": 21,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644545831/27_jwkil9.png",
      "id": 42
    },
    {
      "recipeId": 22,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644545888/72_fq9ca2.png",
      "id": 43
    },
    {
      "recipeId": 22,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644545902/88_me5ehl.png",
      "id": 44
    },
    {
      "recipeId": 23,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644545929/18_spa6ye.png",
      "id": 45
    },
    {
      "recipeId": 24,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644545969/26_hehi1a.png",
      "id": 46
    },
    {
      "recipeId": 25,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644546532/fudge_og5dfo.png",
      "id": 47
    },
    {
      "recipeId": 26,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644546698/desserts_b4jsh6.png",
      "id": 48
    },
    {
      "recipeId": 27,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644546754/45_schr88.png",
      "id": 49
    },
    {
      "recipeId": 32,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644547746/98_esf02y.png",
      "id": 60
    },
    {
      "recipeId": 33,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644548205/33_ubeo2v.png",
      "id": 51
    },
    {
      "recipeId": 34,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644548426/78_mvvveu.png",
      "id": 52
    },
    {
      "recipeId": 35,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644549297/12_hpqzjr.png",
      "id": 53
    },
    {
      "recipeId": 28,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644549437/cheesecake_lad6sn.png",
      "id": 54
    },
    {
      "recipeId": 36,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644550713/1_fzryeo.png",
      "id": 58
    },
    {
      "recipeId": 36,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644553179/2_owwi68.png",
      "id": 57
    },
    {
      "recipeId": 36,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644553285/5_o4armv.png",
      "id": 55
    },
    {
      "recipeId": 12,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644554460/10_lodv52.png",
      "id": 56
    },
    {
      "recipeId": 12,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644554594/4_nhzcka.png",
      "id": 59
    },
    {
      "recipeId": 32,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644554902/99_g5grie.png",
      "id": 50
    },
    {
      "recipeId": 1,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644555531/sugarcookie_shf2rh.png",
      "id": 61
    },
    {
      "recipeId": 37,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644612551/10_qqtnj9.png",
      "id": 62
    },
    {
      "recipeId": 38,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644612941/2_mz5qq9.png",
      "id": 63
    },
    {
      "recipeId": 39,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644613447/13_f5kkz1.png",
      "id": 64
    },
    {
      "recipeId": 40,
      "image_path": "https://res.cloudinary.com/dllowdq2w/image/upload/v1644613903/84_zry6tg.png",
      "id": 65
    }
  ],
  "notes": [
    {
      "recipeId": 1,
      "text": "Add less sugar next time",
      "date": 1635611882958,
      "id": 1
    },
    {
      "recipeId": 1,
      "text": "Add more sugar next time",
      "date": 1635611882958,
      "id": 2
    },
    {
      "recipeId": 1,
      "text": "Next time bake an extra 5 minutes, it was a little teeny bit undercooked in the middle.",
      "date": 1635611882958,
      "id": 3
    }
  ],
  "items": [
    {
      "text": "whip cream",
      "userId": 1,
      "id": 1
    },
    {
      "text": "cream cheese",
      "userId": 1,
      "id": 2
    },
    {
      "text": "butter",
      "userId": 1,
      "id": 3
    },
    {
      "text": "love",
      "userId": 1,
      "id": 4
    }
  ],
  "ratings": [
    {
      "stars": "☆☆☆☆☆",
      "id": 1
    },
    {
      "stars": "★☆☆☆☆",
      "id": 2
    },
    {
      "stars": "★★☆☆☆",
      "id": 3
    },
    {
      "stars": "★★★☆☆",
      "id": 4
    },
    {
      "stars": "★★★★☆",
      "id": 5
    },
    {
      "stars": "★★★★★",
      "id": 6
    }
  ]
}